Andrew417/Gps-project/Keil_Project/TM4C123_GH6PM_Drivers/LCD_Driver/LCD.h
#ifndef LCD_H_
#define LCD_H_

#include "TM4C123.h"
#include <TM4c123gh6pm.h>
#include "stdio.h"
#include "stdlib.h"

//@ref LCD_define
#define LCD_FUNCTION_8BIT_2LINES   		(0x38)
#define LCD_FUNCTION_4BIT_2LINES   		(0x28)
#define LCD_MOVE_DISP_RIGHT       		(0x1C)
#define LCD_MOVE_DISP_LEFT   					(0x18)
#define LCD_MOVE_CURSOR_RIGHT   			(0x14)
#define LCD_MOVE_CURSOR_LEFT 	  			(0x10)
#define LCD_DISP_OFF   								(0x08)
#define LCD_DISP_ON_CURSOR   					(0x0E)
#define LCD_DISP_ON_CURSOR_BLINK   		(0x0F)
#define LCD_DISP_ON_BLINK   					(0x0D)
#define LCD_DISP_ON   								(0x0C)
#define LCD_ENTRY_DEC   							(0x04)
#define LCD_ENTRY_DEC_SHIFT   				(0x05)
#define LCD_ENTRY_INC_   							(0x06)
#define LCD_ENTRY_INC_SHIFT   				(0x07)
#define LCD_BEGIN_AT_FIRST_ROW				(0x80)
#define LCD_BEGIN_AT_SECOND_ROW				(0xC0)
#define LCD_CLEAR_SCREEN							(0x01)
#define LCD_ENTRY_MODE								(0x06)


void LCD_init(void);
void passdata(unsigned char data);
void lcd_data(unsigned char data);
void lcd_cmd(unsigned char cmd);

void delay_ms(uint32_t ms);
void SysTick_Init(void);
void SysTick_Wait_1_ms(uint32_t delay);

void lcd_string( char *str );
void LCD_Print_int(uint16_t number);
void LCD_Print_float(float distance);
#endif